BLACK = '#000000'
GRAY = '#808080'
SILVER = '#C0C0C0'
WHITE = '#FFFFFF'
FUCHSIA = '#FF00FF'
PURPLE = '#800080'
RED = '#FF0000'
MAROON = '#800000'
YELLOW = '#FFFF00'
OLIVE = '#808000'
LIME = '#00FF00'
GREEN = '#008000'
AQUA = '#00FFFF'
TEAL = '#008080'
BLUE = '#0000FF'
NAVY = '#000080'

HEX = [
    (BLACK, 'Черный'),
    (GRAY, 'Серый'),
    (SILVER, 'Серебряный'),
    (WHITE, 'Белый'),
    (FUCHSIA, 'Цвет фуксии (розовый)'),
    (PURPLE, 'Фиолетовый'),
    (RED, 'Красный'),
    (MAROON, 'Бордовый'),
    (YELLOW, 'Желтый'),
    (OLIVE, 'Оливковый'),
    (LIME, 'Лаймовый'),
    (GREEN, 'Зеленый'),
    (AQUA, 'Цвет морской волны'),
    (TEAL, 'Бирюзовый'),
    (BLUE, 'Синий'),
    (NAVY, 'Темно-синий'),
]

UNITS = [
    ('г', 'г'),
    ('стакан', 'стакан'),
    ('по вкусу', 'по вкусу'),
    ('ст. л.', 'ст. л.'),
    ('шт.', 'шт.'),
    ('мл', 'мл'),
    ('ч. л.', 'ч. л.'),
    ('ст. л.', 'ст. л.'),
    ('капля', 'капля'),
    ('звездочка', 'звездочка'),
    ('щепотка', 'щепотка'),
    ('горсть', 'горсть'),
    ('кусок', 'кусок'),
    ('кг', 'кг'),
    ('пакет', 'пакет'),
    ('пучок', 'пучок'),
    ('долька', 'долька'),
    ('банка', 'банка'),
    ('упаковка', 'упаковка'),
    ('зубчик', 'зубчик'),
    ('стручок', 'стручок'),
    ('л', 'л'),
    ('бутылка', 'бутылка'),
    ('тушка', 'тушка'),
    ('батон', 'батон'),
    ('пакетик', 'пакетик'),
    ('лист', 'лист'),
    ('стебель', 'стебель'),
    ('веточка', 'веточка'),
]
